// © Copyright 2004-2007, 2015 HP Development Company, L.P.

TaskName = "Загрузка шрифтов";

OkButtonTitle = "OK";
CancelButtonTitle = "Отмена";
LoadingStorageDeviceInfoProcessTitle = "Загрузка информации о запоминающем устройстве…";
LoadingStorageDeviceListProcessTitle = "Загрузка списка запоминающих устройств…";
LoadingFontListProcessTitle = "Загрузка списка шрифтов…";
SendingFontProcessTitle = "Загружается шрифт \"%@\"…";
RemovingFontProcessTitle = "Удаляется шрифт \"%@\"…";
RemoveConfirmationMessage = "Удалить из принтера выбранные шрифты?";
RemoveConfirmationMessageExplanation = "Данную операцию отменить невозможно.";
StorageDeviceLocked = "Запоминающее устройство заблокировано";
RemoveFromMemoryMessage = "Шрифты нельзя удалить из памяти устройства";
RemoveFromMemoryExplanation = "Все загруженные шрифты доступны только в режиме чтения. Пользовательские шрифты будут удалены из памяти при перезапуске устройства. Шрифты, хранящиеся на других устройствах, сохраняются во время перезагрузки и могут быть удалены вручную.";

DiskNameTemplate = "Диск, ID=%@ (Размер: %@)";
FlashNameTemplate = "\rФлэш-модуль SIMM, ID=%@ (Размер:\r%@)";
SizeInBytes = "%.1f байтов";
SizeInKBytes = "%.1f кбайт";
SizeInMBytes = "%.1f Мбайт";
SizeInGBytes = "%.1f Гбайт";
SizeInTBytes = "%.1f Тбайт";

// Errors
FileOpenError = "Не удается открыть файл шрифта \"%@\".";
FileOpenErrorExplanation = "Данный файл либо поврежден, либо в нем используется неподдерживаемый формат. Выберите другой файл шрифтов и повторите попытку.";
FormatError = "Не распознается формат шрифта \"%@\".";
FormatErrorExplanation = "Выберите другой файл шрифтов и повторите попытку.";
SingleUnsupportedError = "Шрифт \"%@\" не поддерживается.";
SingleUnsupportedErrorExplanation = "Шрифт будет пропущен.";
MultipleUnsupportedError = "Шрифты %@ не поддерживаются.";
MultipleUnsupportedErrorExplanation = "Шрифты будут пропущены.";
SingleAlreadyScheduledError = "В списке уже присутствует шрифт \"%@\".";
SingleAlreadyScheduledErrorExplanation = "Этот шрифт пропускается.";
MultipleAlreadyScheduledError = "Шрифты %@ уже добавлены в список.";
MultipleAlreadyScheduledErrorExplanation = "Шрифты будут пропущены.";
SingleAlreadyUploadedError = "В принтере уже присутствует шрифт \"%@\".";
SingleAlreadyUploadedErrorExplanation = "Этот шрифт пропускается.";
MultipleAlreadyUploadedError = "Шрифты %@ уже добавлены на принтер.";
MultipleAlreadyUploadedErrorExplanation = "Шрифты будут пропущены.";
PrintChannelOpenError = "Не удается открыть канал принтера.";
PrintChannelOpenErrorExplanation = "Убедитесь в том, что принтер подсоединен и включен, затем повторите попытку.";
DataSendError = "Не удается передать данные на принтер.";
DataSendErrorExplanation = "Убедитесь в том, что принтер подсоединен и включен, затем повторите попытку.";
DataReceiveError = "Не удается принять данные из принтера.";
DataReceiveErrorExplanation = "Убедитесь в том, что принтер подсоединен и включен, затем повторите попытку.";
FontSendError = "Не удается передать на принтер данные шрифта \"%@\".";
FontSendErrorExplanation = "Убедитесь в том, что принтер подсоединен и включен. Обратите внимание, что оставшаяся часть списка шрифтов не передана в принтер.";
FontRemoveError = "Не удается удалить из принтера шрифт \"%@\".";
FontRemoveErrorExplanation = "Убедитесь в том, что принтер подсоединен и включен. Обратите внимание, что оставшаяся часть списка шрифтов не удалена из принтера.";
StorageDeviceFullError = "Шрифт \"%@\" невозможно загрузить — запоминающее устройство заполнено.";
StorageDeviceFullErrorExplanation = "Выберите другое запоминающее устройство или удалите часть неиспользуемых шрифтов, затем повторите попытку. Обратите внимание, что оставшаяся часть списка шрифтов не загружена в принтер.";
ScriptProcessingError = "Невозможно обработать сценарий со шрифтом «%@».";
ScriptProcessingErrorExplanation = "Выберите другой шрифт и повторите попытку. Обратите внимание, что оставшаяся часть списка шрифтов не загружена в принтер.";
DeviceVmError = "Шрифт \"%@\" невозможно загрузить из-за нехватки памяти в принтере.";
DeviceVmErrorExplanation = "Выберите другое запоминающее устройство или удалите часть неиспользуемых шрифтов, затем повторите попытку. Обратите внимание, что оставшаяся часть списка шрифтов не загружена в принтер.";

DeviceBusyErrorTitle = "В данный момент устройство занято.";
DeviceBusyErrorMessage = "Дождитесь, когда устройство завершит выполнение текущего задания.";

FontNameTemplate = "\"%@\"";

Memory = "Память";
UpdateNeeded = "Требуется обновление";

TaskTitle = "Загрузка шрифтов";
TaskDescription = "Выберите файл, содержащий шрифты принтера, и передайте этот файл в принтер. После этого переданные шрифты становятся доступными для использования в заданиях печати.";
StorageDevices = "Шрифты в устройстве:";
UpdateButton = "Обновление списка шрифтов";
RemoveButton = "Удалить";
AddButton = "Добавить…";
